install.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>clang-tags &#x2013; Installation guide</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<link type="text/css" href="http://orgmode.org/worg/style/worg.css" title="Standard" rel="stylesheet">
<link type="text/css" href="http://orgmode.org/worg/style/worg-zenburn.css" title="Zenburn" rel="alternate stylesheet">
<link type="text/css" href="http://orgmode.org/worg/style/worg-classic.css" title="Classic" rel="alternate stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">clang-tags &#x2013; Installation guide</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Requirements</a></li>
<li><a href="#sec-2">2. Building</a></li>
<li><a href="#sec-3">3. Testing and using without installing</a></li>
<li><a href="#sec-4">4. Installing</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Requirements</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>cmake</code>
</li>
<li>a C++11 compiler (e.g. <code>g++</code> or <code>clang++</code>)
</li>
<li><code>boost</code> (at least the <code>system</code> and <code>asio</code> components)
</li>
<li><code>jsoncpp</code>
</li>
<li><code>libclang</code> (&gt;= 3.0)
</li>
<li><code>sqlite3</code>
</li>
<li><code>socat</code>
</li>
<li><code>strace</code>
</li>
<li><code>python</code> (&gt;= 2.3)
<ul class="org-ul">
<li>a version newer than 2.7 is recommended to benefit from the more recent
      <code>argparse</code> module.
</li>
</ul>
</li>
</ul>


<p>
The following are recommended:
</p>
<ul class="org-ul">
<li><code>git</code>: to get the latest version
</li>
<li><code>pkg-config</code>: helps finding other requirements
</li>
<li><code>emacs</code>: obviously required for the Emacs interface
</li>
</ul>


<p>
And here are a few suggested packages:
</p>
<ul class="org-ul">
<li><code>doxygen</code>: required to build the developer documentation
</li>
<li><code>org-mode</code>: required to build user documentation
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Building</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>clang-tags</code> uses <a href="http://www.cmake.org/"><code>CMake</code></a> as a build system.
</p>

<p>
Provided that the dependencies are installed (in standard locations), a complete
build and test process should be as simple as:
</p>

<div class="org-src-container">

<pre class="src src-sh">cmake path/to/sources
make
make test
</pre>
</div>


<p>
As an example, here is an installation procedure which has been tested on
a fresh Debian Jessie system:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Install dependencies</span>
su -c <span style="color: #8b2252;">"apt-get install build-essential git cmake pkg-config \</span>
<span style="color: #8b2252;">                       libboost-system-dev libjsoncpp-dev   \</span>
<span style="color: #8b2252;">                       libclang-dev libsqlite3-dev socat    \</span>
<span style="color: #8b2252;">                       strace emacs"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Get clang-tags sources</span>
mkdir clang-tags &amp;&amp; <span style="color: #7a378b;">cd</span> clang-tags
git clone https://github.com/ffevotte/clang-tags.git src

<span style="color: #b22222;"># </span><span style="color: #b22222;">Create a build directory</span>
mkdir build &amp;&amp; <span style="color: #7a378b;">cd</span> build

<span style="color: #b22222;"># </span><span style="color: #b22222;">Configure the project</span>
cmake ../src

<span style="color: #b22222;"># </span><span style="color: #b22222;">Build and run tests</span>
make
make test
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><a id="ID-9919342a-dc4f-48b9-be0e-8c3f60b89a00" name="ID-9919342a-dc4f-48b9-be0e-8c3f60b89a00"></a><span class="section-number-2">3</span> Testing and using without installing</h2>
<div class="outline-text-2" id="text-3">

<p>
It is possible to use <code>clang-tags</code> immediately after the build, without
properly installing it on the system. Two environment setup scripts are
generated during the build to help in this respect:
</p>

<ul class="org-ul">
<li><b><b>setup the shell environment</b></b>: <code>env.sh</code> appropriately sets the required
environment variables, such as <code>PATH</code>:

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #7a378b;">source</span> env.sh
</pre>
</div>
</li>

<li><b><b>setup script for Emacs</b></b>: <code>env.el</code> sets the required environment variables
and loads the <code>clang-tags.el</code> library. You can either:
<ul class="org-ul">
<li>load it interactively: <code>M-x load-file RET /path/to/build/env.el RET</code>
</li>
<li>or put the following in your Emacs initialization file
(<code>~/.emacs.d/init.el</code> or <code>~/.emacs</code>):

<div class="org-src-container">

<pre class="src src-emacs-lisp">(load-file <span style="color: #8b2252;">"/path/to/build/env.el"</span>)
</pre>
</div>
</li>
</ul>
<p>
Now would be a good time to proceed to the <a href="quickStart.html">quick start guide</a> or the <a href="index.html">user
 manual</a> to ger started using <code>clang-tags</code>.
</p>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Installing</h2>
<div class="outline-text-2" id="text-4">
<p>
Running <code>make install</code> in the build directory should install <code>clang-tags</code>, but
this has not been tested much yet. For now, it is safer to follow the
instructions in the previous section.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.6)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
